memtier/performance/data/pi4/strong.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets         2484.93          ---          ---         7.32344         6.75100        20.09500        21.50300        24.70300       169.59 
Gets        24847.51        16.67     24830.84         7.31201         6.75100        19.96700        21.50300        24.44700       629.18 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals      27332.44        16.67     24830.84         7.31305         6.75100        19.96700        21.50300        24.44700       798.78 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.511        0.000
SET       2.207        5.000
SET       2.671       10.000
SET       3.135       15.000
SET       3.663       20.000
SET       4.095       25.000
SET       4.639       30.000
SET       5.087       35.000
SET       5.663       40.000
SET       6.207       45.000
SET       6.751       50.000
SET       7.007       52.500
SET       7.263       55.000
SET       7.551       57.500
SET       7.807       60.000
SET       8.031       62.500
SET       8.191       65.000
SET       8.383       67.500
SET       8.639       70.000
SET       9.023       72.500
SET       9.535       75.000
SET       9.855       76.250
SET      10.111       77.500
SET      10.367       78.750
SET      10.623       80.000
SET      10.879       81.250
SET      11.135       82.500
SET      11.391       83.750
SET      11.647       85.000
SET      11.967       86.250
SET      12.287       87.500
SET      12.415       88.125
SET      12.607       88.750
SET      12.799       89.375
SET      12.927       90.000
SET      13.119       90.625
SET      13.311       91.250
SET      13.567       91.875
SET      13.759       92.500
SET      14.015       93.125
SET      14.271       93.750
SET      14.399       94.062
SET      14.591       94.375
SET      14.719       94.688
SET      14.911       95.000
SET      15.103       95.312
SET      15.295       95.625
SET      15.551       95.938
SET      15.807       96.250
SET      16.063       96.562
SET      16.319       96.875
SET      16.511       97.031
SET      16.639       97.188
SET      16.767       97.344
SET      17.023       97.500
SET      17.151       97.656
SET      17.407       97.812
SET      17.535       97.969
SET      17.919       98.125
SET      18.175       98.281
SET      18.559       98.438
SET      18.815       98.516
SET      18.943       98.594
SET      19.199       98.672
SET      19.455       98.750
SET      19.583       98.828
SET      19.839       98.906
SET      19.967       98.984
SET      20.223       99.062
SET      20.479       99.141
SET      20.607       99.219
SET      20.735       99.258
SET      20.863       99.297
SET      20.991       99.336
SET      21.119       99.375
SET      21.247       99.414
SET      21.375       99.453
SET      21.503       99.492
SET      21.631       99.531
SET      21.759       99.570
SET      21.887       99.609
SET      22.015       99.629
SET      22.143       99.648
SET      22.143       99.668
SET      22.271       99.688
SET      22.399       99.707
SET      22.527       99.727
SET      22.655       99.746
SET      22.783       99.766
SET      22.911       99.785
SET      23.167       99.805
SET      23.295       99.814
SET      23.295       99.824
SET      23.423       99.834
SET      23.551       99.844
SET      23.807       99.854
SET      23.935       99.863
SET      24.063       99.873
SET      24.319       99.883
SET      24.575       99.893
SET      24.831       99.902
SET      24.959       99.907
SET      25.215       99.912
SET      25.471       99.917
SET      25.727       99.922
SET      26.111       99.927
SET      26.623       99.932
SET      27.391       99.937
SET      28.543       99.941
SET      29.439       99.946
SET      30.335       99.951
SET      30.719       99.954
SET      30.975       99.956
SET      31.103       99.958
SET      31.359       99.961
SET      31.743       99.963
SET      32.255       99.966
SET      33.535       99.968
SET      35.327       99.971
SET      36.351       99.973
SET      37.119       99.976
SET      37.119       99.977
SET      37.375       99.978
SET      37.631       99.979
SET      37.887       99.980
SET      38.143       99.982
SET      38.655       99.983
SET      38.911       99.984
SET      39.167       99.985
SET      39.423       99.987
SET      39.679       99.988
SET      39.679       99.988
SET      39.935       99.989
SET      39.935       99.990
SET      40.191       99.990
SET      40.191       99.991
SET      40.191       99.991
SET      40.447       99.992
SET      40.703       99.993
SET      40.959       99.993
SET      41.215       99.994
SET      41.471       99.994
SET      41.471       99.995
SET      42.239       99.995
SET      43.263       99.995
SET      43.519       99.995
SET      43.775       99.996
SET      44.031       99.996
SET      44.543       99.996
SET      44.543       99.997
SET      45.311       99.997
SET      45.567       99.997
SET      45.567       99.997
SET      45.823       99.997
SET      46.079       99.998
SET      46.847       99.998
SET      47.103       99.998
SET      47.103       99.998
SET      47.871       99.998
SET      47.871       99.998
SET      48.383       99.998
SET      48.639       99.999
SET      48.639       99.999
SET      48.895       99.999
SET      48.895       99.999
SET      48.895       99.999
[...]
SET      49.151       99.999
SET      49.151       99.999
SET      49.919       99.999
SET      50.431       99.999
SET      51.967       99.999
SET      51.967       99.999
SET      51.967       99.999
[...]
SET      52.991       99.999
SET      52.991      100.000
SET      53.247      100.000
SET      53.247      100.000
SET      53.503      100.000
SET      53.503      100.000
SET      53.503      100.000
SET      54.015      100.000
SET      54.015      100.000
SET      54.015      100.000
SET      54.783      100.000
SET      54.783      100.000
SET      54.783      100.000
[...]
SET      58.367      100.000
SET      58.367      100.000
SET      58.367      100.000
[...]
SET      58.879      100.000
SET      58.879      100.000
SET      58.879      100.000
[...]
SET      59.647      100.000
SET      59.647      100.000
---
GET       0.343        0.000
GET       2.207        5.000
GET       2.671       10.000
GET       3.135       15.000
GET       3.647       20.000
GET       4.095       25.000
GET       4.639       30.000
GET       5.087       35.000
GET       5.631       40.000
GET       6.207       45.000
GET       6.751       50.000
GET       7.007       52.500
GET       7.263       55.000
GET       7.519       57.500
GET       7.807       60.000
GET       8.031       62.500
GET       8.191       65.000
GET       8.383       67.500
GET       8.639       70.000
GET       9.023       72.500
GET       9.535       75.000
GET       9.791       76.250
GET      10.111       77.500
GET      10.367       78.750
GET      10.623       80.000
GET      10.879       81.250
GET      11.135       82.500
GET      11.391       83.750
GET      11.647       85.000
GET      11.967       86.250
GET      12.287       87.500
GET      12.415       88.125
GET      12.607       88.750
GET      12.735       89.375
GET      12.927       90.000
GET      13.119       90.625
GET      13.311       91.250
GET      13.503       91.875
GET      13.759       92.500
GET      14.015       93.125
GET      14.271       93.750
GET      14.399       94.062
GET      14.527       94.375
GET      14.719       94.688
GET      14.911       95.000
GET      15.103       95.312
GET      15.295       95.625
GET      15.487       95.938
GET      15.743       96.250
GET      15.999       96.562
GET      16.319       96.875
GET      16.511       97.031
GET      16.639       97.188
GET      16.767       97.344
GET      16.895       97.500
GET      17.151       97.656
GET      17.279       97.812
GET      17.535       97.969
GET      17.919       98.125
GET      18.175       98.281
GET      18.559       98.438
GET      18.815       98.516
GET      18.943       98.594
GET      19.199       98.672
GET      19.327       98.750
GET      19.583       98.828
GET      19.839       98.906
GET      19.967       98.984
GET      20.223       99.062
GET      20.351       99.141
GET      20.607       99.219
GET      20.735       99.258
GET      20.863       99.297
GET      20.991       99.336
GET      21.119       99.375
GET      21.247       99.414
GET      21.375       99.453
GET      21.503       99.492
GET      21.631       99.531
GET      21.759       99.570
GET      21.887       99.609
GET      22.015       99.629
GET      22.143       99.648
GET      22.143       99.668
GET      22.271       99.688
GET      22.399       99.707
GET      22.527       99.727
GET      22.655       99.746
GET      22.783       99.766
GET      22.911       99.785
GET      23.039       99.805
GET      23.167       99.814
GET      23.295       99.824
GET      23.423       99.834
GET      23.423       99.844
GET      23.551       99.854
GET      23.807       99.863
GET      23.935       99.873
GET      24.063       99.883
GET      24.319       99.893
GET      24.575       99.902
GET      24.703       99.907
GET      24.831       99.912
GET      25.087       99.917
GET      25.215       99.922
GET      25.471       99.927
GET      25.855       99.932
GET      26.239       99.937
GET      26.879       99.941
GET      28.031       99.946
GET      29.439       99.951
GET      30.079       99.954
GET      30.463       99.956
GET      30.719       99.958
GET      30.975       99.961
GET      31.231       99.963
GET      31.487       99.966
GET      31.999       99.968
GET      33.023       99.971
GET      34.559       99.973
GET      36.351       99.976
GET      36.863       99.977
GET      37.119       99.978
GET      37.375       99.979
GET      37.631       99.980
GET      37.887       99.982
GET      38.143       99.983
GET      38.399       99.984
GET      38.655       99.985
GET      38.911       99.987
GET      39.167       99.988
GET      39.423       99.988
GET      39.423       99.989
GET      39.679       99.990
GET      39.679       99.990
GET      39.935       99.991
GET      39.935       99.991
GET      40.191       99.992
GET      40.447       99.993
GET      40.703       99.993
GET      40.959       99.994
GET      41.215       99.994
GET      41.471       99.995
GET      41.727       99.995
GET      42.239       99.995
GET      42.751       99.995
GET      43.519       99.996
GET      43.775       99.996
GET      44.031       99.996
GET      44.543       99.997
GET      44.799       99.997
GET      45.055       99.997
GET      45.311       99.997
GET      45.823       99.997
GET      46.335       99.998
GET      46.591       99.998
GET      47.359       99.998
GET      47.615       99.998
GET      47.871       99.998
GET      48.127       99.998
GET      48.383       99.998
GET      48.383       99.999
GET      48.639       99.999
GET      48.639       99.999
GET      48.895       99.999
GET      48.895       99.999
GET      49.151       99.999
GET      49.407       99.999
GET      49.407       99.999
GET      49.663       99.999
GET      50.175       99.999
GET      50.431       99.999
GET      50.431       99.999
GET      50.687       99.999
GET      50.943       99.999
GET      51.199       99.999
GET      51.455       99.999
GET      51.967      100.000
GET      52.223      100.000
GET      52.735      100.000
GET      52.991      100.000
GET      53.247      100.000
GET      53.247      100.000
GET      53.503      100.000
GET      53.759      100.000
GET      54.271      100.000
GET      54.783      100.000
GET      55.295      100.000
GET      55.551      100.000
GET      55.807      100.000
GET      56.063      100.000
GET      56.063      100.000
GET      56.575      100.000
GET      56.575      100.000
GET      57.087      100.000
GET      57.087      100.000
GET      58.367      100.000
GET      58.879      100.000
GET      59.135      100.000
GET      59.135      100.000
GET      59.135      100.000
GET      59.391      100.000
GET      59.647      100.000
GET      59.647      100.000
GET      59.647      100.000
[...]
GET      59.903      100.000
GET      59.903      100.000
GET      59.903      100.000
[...]
GET      60.159      100.000
GET      60.159      100.000
GET      60.159      100.000
GET      60.415      100.000
GET      60.415      100.000
GET      60.671      100.000
GET      60.671      100.000
GET      60.671      100.000
GET      61.439      100.000
GET      61.439      100.000
GET      61.439      100.000
[...]
GET      62.719      100.000
GET      62.719      100.000
GET      62.719      100.000
[...]
GET      62.975      100.000
GET      62.975      100.000
GET      62.975      100.000
[...]
GET      64.255      100.000
GET      64.255      100.000
---
WAIT      0.000      100.000